const cartsMock = [
  {
    product: {
      id: '9bd9d8d6-9a67-44e0-b467-cc8796ed151a',
      title: 'Подгузники',
      description: 'Подгузник — вид нижнего белья. В большинстве случаев используется детьми, космонавтами, монтажниками, пилотами, альпинистами, снайперами, водолазами, лежачими больными, больными тяжёлыми психическими и урологическими заболеваниями.',
      category: 'Одежда',
      price: 100.5,
      picture: 'https://static.detmir.st/media_pim/233/966/4966233/450/0.jpg?1675162983257',
      rating: 4.7,
    },
    quantity: 42,
    createdAt: '2023-04-02T17:27:07.595Z',
  },
  {
    product: {
      id: '2',
      title: 'Подгузники',
      description: 'Подгузник — вид нижнего белья. В большинстве случаев используется детьми, космонавтами, монтажниками, пилотами, альпинистами, снайперами, водолазами, лежачими больными, больными тяжёлыми психическими и урологическими заболеваниями.',
      category: 'Одежда',
      price: 100.5,
      picture: 'https://static.detmir.st/media_pim/281/368/368281/450/0.jpg?1678264853784',
      rating: 4.7,
    },
    quantity: 42,
    createdAt: '2023-04-02T17:27:07.595Z',
  },
  {
    product: {
      id: '2a',
      title: 'Подгузники',
      description: 'Подгузник — вид нижнего белья. В большинстве случаев используется детьми, космонавтами, монтажниками, пилотами, альпинистами, снайперами, водолазами, лежачими больными, больными тяжёлыми психическими и урологическими заболеваниями.',
      category: 'Одежда',
      price: 100.5,
      picture: 'https://static.detmir.st/media_out/189/094/3094189/450/0.jpg?1652264500031',
      rating: 4.7,
    },
    quantity: 42,
    createdAt: '2023-04-02T17:27:07.595Z',
  },
];
export default cartsMock;
