import { IOrder } from '@/interfaces/order-interface';

const orderListMock: IOrder[] = [
  {
    number: '344300',
    products: [
      {
        product: {
          id: '6024090',
          category: 'LEGO',
          title: 'Конструктор Lego Самосвал Техник 42147',
          description: '<p>Любите технику? Собирайте, изучайте и играйте с Lego Technic! Создайте детализированную модель строительной техники из конструктора Dump Truck.</p><ul><li>Два варианта сборки: самосвал и экскаватор.</li><li>Откидной кузов самосвала.</li><li>Подвижный ковш экскаватора.</li></ul><p><strong>Характеристики</strong></p><ul><li>Количество деталей: 177</li><li>От 7 лет</li></ul>',
          price: 1299,
          picture: 'https://static.detmir.st/media_pim/090/024/6024090/450/0.jpg?1673616044746',
          rating: 5,
        },
        quantity: 3,
      },
      {
        product: {
          id: '368281',
          category: 'Demi Star',
          title: 'Коляска Demi Star Ретро Lux collection',
          description: '<p>Классическая коляска для кукол Demi Star Lux collection выполнена в стиле Ретро. Играть с красивой и удобной люлькой приятно вдвойне!</p><ul><li>Оригинальный благородный стиль</li><li>Нескользящее покрытие колес</li><li>Удобная ручка с накладкой</li><li>Складной козырек </li></ul><h3>Характеристики</h3><ul><li>Размер коляски: 59,5х32,5х66 см</li><li>Размер люльки (спальное место): 47х26 см</li><li>Подходит для кукол высотой до 45 см </li><li>Материал колес: верхняя часть колес EVA, внутренняя PP</li><li>Высота от ручки до пола 62 см</li><li>Высота от пола до капюшона 66 см.</li></ul>',
          price: 3799,
          picture: 'https://static.detmir.st/media_pim/281/368/368281/450/0.jpg?1678264853784',
          rating: 4.9,
        },
        quantity: 2,
      },
    ],
    createdAt: '2023-04-02T17:27:07.595Z',
  },
  {
    number: '565439',
    products: [
      {
        product: {
          id: '49662333',
          category: 'Demi Star',
          title: 'Коляска для кукол Demi Star прогулочная 9351 Rain Unic',
          description: '<p>Прогулочная кукольная коляска Demi Star удивительно похожа на настоящую. Девочка будет в восторге от реалистичной игры в дочки-матери. </p><ul><li>Складывается "книжкой". </li><li>Расположение рукояток можно регулировать (повернуть вокруг своей оси). </li><li>Спинка раскладывается. </li><li>Багажная корзинка внизу коляски. </li><li>Ремни безопасности для куклы. </li><li>Козырек от солнца. </li><li>Яркий дизайн с красивыми рисунками. </li></ul><p><strong>Характеристики </strong></p><ul><li>Предназначено для детей от 3 лет </li><li>Размер: 54х34,5х65,5 см </li><li>Высота от пола до ручек: 65,5 см</li></ul>',
          price: 1999,
          picture: 'https://static.detmir.st/media_pim/233/966/4966233/450/0.jpg?1675162983257',
          rating: 5,
        },
        quantity: 3,
      },
      {
        product: {
          id: '3682811',
          category: 'Demi Star',
          title: 'Коляска Demi Star Ретро Lux collection',
          description: '<p>Классическая коляска для кукол Demi Star Lux collection выполнена в стиле Ретро. Играть с красивой и удобной люлькой приятно вдвойне!</p><ul><li>Оригинальный благородный стиль</li><li>Нескользящее покрытие колес</li><li>Удобная ручка с накладкой</li><li>Складной козырек </li></ul><h3>Характеристики</h3><ul><li>Размер коляски: 59,5х32,5х66 см</li><li>Размер люльки (спальное место): 47х26 см</li><li>Подходит для кукол высотой до 45 см </li><li>Материал колес: верхняя часть колес EVA, внутренняя PP</li><li>Высота от ручки до пола 62 см</li><li>Высота от пола до капюшона 66 см.</li></ul>',
          price: 3799,
          picture: 'https://static.detmir.st/media_pim/281/368/368281/450/0.jpg?1678264853784',
          rating: 4.9,
        },
        quantity: 2,
      },
    ],
    createdAt: '2023-04-02T17:27:07.595Z',
  },
  {
    number: '344303',
    products: [
      {
        product: {
          id: '6024090',
          category: 'LEGO',
          title: 'Конструктор Lego Самосвал Техник 42147',
          description: '<p>Любите технику? Собирайте, изучайте и играйте с Lego Technic! Создайте детализированную модель строительной техники из конструктора Dump Truck.</p><ul><li>Два варианта сборки: самосвал и экскаватор.</li><li>Откидной кузов самосвала.</li><li>Подвижный ковш экскаватора.</li></ul><p><strong>Характеристики</strong></p><ul><li>Количество деталей: 177</li><li>От 7 лет</li></ul>',
          price: 1299,
          picture: 'https://static.detmir.st/media_pim/090/024/6024090/450/0.jpg?1673616044746',
          rating: 5,
        },
        quantity: 3,
      },
      {
        product: {
          id: '368281',
          category: 'Demi Star',
          title: 'Коляска Demi Star Ретро Lux collection',
          description: '<p>Классическая коляска для кукол Demi Star Lux collection выполнена в стиле Ретро. Играть с красивой и удобной люлькой приятно вдвойне!</p><ul><li>Оригинальный благородный стиль</li><li>Нескользящее покрытие колес</li><li>Удобная ручка с накладкой</li><li>Складной козырек </li></ul><h3>Характеристики</h3><ul><li>Размер коляски: 59,5х32,5х66 см</li><li>Размер люльки (спальное место): 47х26 см</li><li>Подходит для кукол высотой до 45 см </li><li>Материал колес: верхняя часть колес EVA, внутренняя PP</li><li>Высота от ручки до пола 62 см</li><li>Высота от пола до капюшона 66 см.</li></ul>',
          price: 3799,
          picture: 'https://static.detmir.st/media_pim/281/368/368281/450/0.jpg?1678264853784',
          rating: 4.9,
        },
        quantity: 2,
      },
    ],
    createdAt: '2023-04-02T17:27:07.595Z',
  },
  {
    number: '565432',
    products: [
      {
        product: {
          id: '49662333',
          category: 'Demi Star',
          title: 'Коляска для кукол Demi Star прогулочная 9351 Rain Unic',
          description: '<p>Прогулочная кукольная коляска Demi Star удивительно похожа на настоящую. Девочка будет в восторге от реалистичной игры в дочки-матери. </p><ul><li>Складывается "книжкой". </li><li>Расположение рукояток можно регулировать (повернуть вокруг своей оси). </li><li>Спинка раскладывается. </li><li>Багажная корзинка внизу коляски. </li><li>Ремни безопасности для куклы. </li><li>Козырек от солнца. </li><li>Яркий дизайн с красивыми рисунками. </li></ul><p><strong>Характеристики </strong></p><ul><li>Предназначено для детей от 3 лет </li><li>Размер: 54х34,5х65,5 см </li><li>Высота от пола до ручек: 65,5 см</li></ul>',
          price: 1999,
          picture: 'https://static.detmir.st/media_pim/233/966/4966233/450/0.jpg?1675162983257',
          rating: 5,
        },
        quantity: 3,
      },
      {
        product: {
          id: '3682811',
          category: 'Demi Star',
          title: 'Коляска Demi Star Ретро Lux collection',
          description: '<p>Классическая коляска для кукол Demi Star Lux collection выполнена в стиле Ретро. Играть с красивой и удобной люлькой приятно вдвойне!</p><ul><li>Оригинальный благородный стиль</li><li>Нескользящее покрытие колес</li><li>Удобная ручка с накладкой</li><li>Складной козырек </li></ul><h3>Характеристики</h3><ul><li>Размер коляски: 59,5х32,5х66 см</li><li>Размер люльки (спальное место): 47х26 см</li><li>Подходит для кукол высотой до 45 см </li><li>Материал колес: верхняя часть колес EVA, внутренняя PP</li><li>Высота от ручки до пола 62 см</li><li>Высота от пола до капюшона 66 см.</li></ul>',
          price: 3799,
          picture: 'https://static.detmir.st/media_pim/281/368/368281/450/0.jpg?1678264853784',
          rating: 4.9,
        },
        quantity: 2,
      },
    ],
    createdAt: '2023-04-02T17:27:07.595Z',
  },
];

export default orderListMock;
